axf33480/ESP32CommandStation/src/Interfaces/http/HttpRequestFlow.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"
#include "interfaces/http/Http.h"

namespace esp32cs
{
namespace http
{

static vector<string> captive_portal_uris =
{
  "/generate_204",                  // Android
  "/gen_204",                       // Android 9.0
  "/mobile/status.php",             // Android 8.0 (Samsung s9+)
  "/ncsi.txt",                      // Windows
  "/success.txt",                   // OSX / FireFox
  "/hotspot-detect.html",           // iOS 8/9
  "/hotspotdetect.html",            // iOS 8/9
  "/library/test/success.html"      // iOS 8/9
  "/kindle-wifi/wifiredirect.html"  // Kindle
  "/kindle-wifi/wifistub.html"      // Kindle
};

HttpRequestFlow::HttpRequestFlow(Httpd *server, int fd
                               , uint32_t remote_ip)
                               : StateFlowBase(server)
                               , server_(server)
                               , fd_(fd)
                               , remote_ip_(remote_ip)
{
  start_flow(STATE(start_request));
  LOG(VERBOSE, "[Httpd fd:%d] Connected.", fd_);
}

HttpRequestFlow::~HttpRequestFlow()
{
  if (close_)
  {
    LOG(VERBOSE, "[Httpd fd:%d] Closed", fd_);
    ::close(fd_);
  }
}

StateFlowBase::Action HttpRequestFlow::start_request()
{
  LOG(VERBOSE, "[Httpd fd:%d] reading header", fd_);
  req_.reset();
  part_boundary_.assign("");
  part_filename_.assign("");
  part_type_.assign("");
  raw_header_.assign("");
  start_time_ = esp_timer_get_time();
  buf_.resize(header_read_size_);
  return read_repeated_with_timeout(&helper_, timeout_, fd_, buf_.data()
                                  , header_read_size_
                                  , STATE(parse_header_data));
}

StateFlowBase::Action HttpRequestFlow::parse_header_data()
{
  if (helper_.hasError_)
  {
    req_.error(true);
    return call_immediately(STATE(request_complete));
  }
  else if (helper_.remaining_ == header_read_size_ || buf_.empty())
  {
    return yield_and_call(STATE(read_more_data));
  }

  raw_header_.append((char *)buf_.data()
                   , header_read_size_ - helper_.remaining_);

  // if we don't have an EOL string in the data yet, get more data
  if (raw_header_.find(HTML_EOL) == string::npos)
  {
    return yield_and_call(STATE(read_more_data));
  }

  // parse the data we have into delimited lines of header data, this will
  // leave some data in the raw_header_ which will need to be pushed back
  // into the buf_ after we reach the body segment.
  vector<string> lines;
  size_t parsed = tokenize(raw_header_, lines, HTML_EOL, false);

  // drop whatever has been tokenized so we don't process it again
  raw_header_.erase(0, parsed);

  // the first line is always the request line
  if (req_.raw_method().empty())
  {
    vector<string> request;
    tokenize(lines[0], request, " ");
    if (request.size() != 3)
    {
      LOG_ERROR("[Httpd fd:%d] Malformed request: %s.", fd_, lines[0].c_str());
      req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      return call_immediately(STATE(abort_request));
    }
    req_.method(request[0]);
    vector<string> uri_parts;
    tokenize(request[1], uri_parts, "?");
    req_.uri(uri_parts[0]);
    uri_parts.erase(uri_parts.begin());
    for (string &part : uri_parts)
    {
      vector<string> params;
      tokenize(part, params, "&");
      for (auto param : params)
      {
        req_.param(break_string(param, "="));
      }
    }
    // remove the first line since we processed it
    lines.erase(lines.begin());
  }

  // process any remaining lines as headers until we reach a blank line
  size_t processed_lines = 0;
  for (auto &line : lines)
  {
    processed_lines++;
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] line(%zu/%zu): ||%s||"
      , fd_, req_.uri().c_str(), processed_lines, lines.size(), line.c_str());
    // check if we have reached a blank line, this is immediately after the
    // last header in the request.
    if (line.empty())
    {
      // Now that we have the request headers parsed we can check if the
      // request exceeds the size limits of the server.
      if (server_->is_request_too_large(&req_))
      {
        // If the request has the EXPECT header we can reject the request with
        // the EXPECTATION_FAILED (417) status, otherwise reject it with
        // BAD_REQUEST (400).
        req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
        if (req_.has_header(HttpHeader::EXPECT))
        {
          req_.set_status(HttpStatusCode::STATUS_EXPECATION_FAILED);
        }
        LOG_ERROR("[Httpd fd:%d,uri:%s] Request body is too large, "
                  "aborting with status %d"
                , fd_, req_.uri().c_str(), res_->code_);
        return call_immediately(STATE(abort_request));
      }

      if (!server_->is_servicable_uri(&req_))
      {
        // check if it is a captive portal request
        if (server_->captive_active_ &&
            std::find_if(captive_portal_uris.begin(), captive_portal_uris.end()
                      , [&](const string &ent) {return !ent.compare(req_.uri());})
            != captive_portal_uris.end() && remote_ip_)
        {
          if (!server_->captive_auth_.count(remote_ip_) ||
              (server_->captive_auth_[remote_ip_] > server_->captive_timeout_ &&
              server_->captive_timeout_ != UINT32_MAX))
          {
            // new client or authentication expired, send the canned response
            res_.reset(new StringResponse(server_->captive_response_
                                        , MIME_TYPE_TEXT_HTML));
          }
          else if (req_.uri().find("_204") > 0 ||
                  req_.uri().find("status.php") > 0)
          {
            // These URIs require a generic response with code 204
            res_.reset(
              new AbstractHttpResponse(HttpStatusCode::STATUS_NO_CONTENT));
          }
          else if (req_.uri().find("ncsi.txt") > 0)
          {
            // Windows success page content
            res_.reset(
              new StringResponse("Microsoft NCSI", MIME_TYPE_TEXT_PLAIN));
          }
          else if (req_.uri().find("success.txt") > 0)
          {
            // Generic success.txt page content
            res_.reset(
              new StringResponse("success", MIME_TYPE_TEXT_PLAIN));
          }
          else
          {
            // iOS success page content
            res_.reset(
              new StringResponse("<HTML><HEAD><TITLE>Success</TITLE></HEAD>"
                                "<BODY>Success</BODY></HTML>"
                              , MIME_TYPE_TEXT_HTML));
          }
        }
        else if (server_->captive_active_ &&
                !server_->captive_auth_uri_.compare(req_.uri()))
        {
          server_->captive_auth_[remote_ip_] =
            esp_timer_get_time() + server_->captive_timeout_;
          res_.reset(new AbstractHttpResponse(HttpStatusCode::STATUS_OK));
        }
        else
        {
          LOG_ERROR("[Httpd fd:%d,uri:%s] Unknown URI, sending 404", fd_
                  , req_.uri().c_str());
          res_.reset(new UriNotFoundResponse(req_.uri()));
        }
        req_.error(true);
        return call_immediately(STATE(send_response_headers));
      }

