axf33480/ESP32CommandStation/src/Interfaces/http/HttpRequestFlow.cpp
      // Check if we have processed all parsed lines, if not add them back to
      // the buffer for deferred processing.
      if (processed_lines != lines.size())
      {
        LOG(VERBOSE
          , "[Httpd fd:%d,uri:%s] Processed %zu/%zu lines, adding remaining "
            "lines to body payload"
          , fd_, req_.uri().c_str(), processed_lines, lines.size());
        string unprocessed = string_join(lines.begin() + processed_lines
                                       , lines.end(), HTML_EOL) + raw_header_;
        raw_header_.assign(unprocessed);
      }

      return yield_and_call(STATE(process_request));
    }
    else
    {
      // it appears to be a header entry, break it and store it in the request
      req_.header(break_string(line, ": "));
    }
  }

  return yield_and_call(STATE(read_more_data));
}

StateFlowBase::Action HttpRequestFlow::process_request()
{
  LOG(VERBOSE, "[Httpd fd:%d] %s", fd_, req_.to_string().c_str());

  if (!req_.header(HttpHeader::UPGRADE).compare(HTTP_UPGRADE_HEADER_WEBSOCKET))
  {
    // upgrade to websocket!
    if (!req_.has_header(HttpHeader::WS_VERSION) ||
        !req_.has_header(HttpHeader::WS_KEY))
    {
      LOG_ERROR("[Httpd fd:%d,uri:%s] Missing required websocket header(s)\n%s"
              , fd_, req_.uri().c_str(), req_.to_string().c_str());
      req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      return call_immediately(STATE(abort_request));
    }
    return call_immediately(STATE(upgrade_to_websocket));
  }

  // if it is a PUT or POST and there is a content-length header we need to
  // read the body of the message in chunks and pass it off to the request
  // handler.
  if ((req_.method() == HttpMethod::POST || req_.method() == HttpMethod::PUT)
    && server_->stream_handler(req_.uri()))
  {
    if (!req_.has_header(HttpHeader::CONTENT_LENGTH))
    {
      // bad request!
    }
    // resize the buffer for max chunk size
    buf_.resize(body_read_size_);
    buf_.clear();

    // move the raw unparsed header bits back to the buffer
    if (!raw_header_.empty())
    {
      buf_.assign(raw_header_.begin(), raw_header_.end());
      raw_header_.assign("");
    }

    // extract the body length from the content length header
    body_len_ = std::stoul(req_.header(HttpHeader::CONTENT_LENGTH));
    LOG(INFO, "[Httpd fd:%d,uri:%s] body (header): %zu", fd_
      , req_.uri().c_str(), body_len_);

    part_stream_ = server_->stream_handler(req_.uri());

    if (req_.content_type() == ContentType::MULTIPART_FORMDATA)
    {
      LOG(VERBOSE, "Converting to multipart/form-data req");
      // force request to be concluded at end of processing
      req_.header(HttpHeader::CONNECTION, HTTP_CONNECTION_CLOSE);
      return call_immediately(STATE(start_multipart_processing));
    }

    // we have some of the body already read in, process it before requesting
    // more data
    if (!buf_.empty())
    {
      return yield_and_call(STATE(stream_body));
    }
    else
    {
      // read the payload and process it in chunks
      return read_repeated_with_timeout(&helper_, timeout_, fd_
                                      , buf_.data() + buf_.size()
                                      , std::min(body_len_, body_read_size_)
                                      , STATE(stream_body));
    }
  }

  if (server_->have_known_response(req_.uri()))
  {
    res_ = server_->response(&req_);
  }
  else
  {
    auto handler = server_->handler(req_.method(), req_.uri());
    auto res = handler(&req_);
    if (res && !res_)
    {
      res_.reset(res);
    }
  }

  return yield_and_call(STATE(send_response_headers));
}

StateFlowBase::Action HttpRequestFlow::read_more_data()
{
  // we need more data to parse the request
  LOG(VERBOSE, "[Httpd fd:%d] Requesting more data to process request", fd_);
  return read_repeated_with_timeout(&helper_, timeout_, fd_, buf_.data()
                              , header_read_size_, STATE(parse_header_data));
}

StateFlowBase::Action HttpRequestFlow::stream_body()
{
  if (helper_.hasError_)
  {
    req_.error(true);
    return call_immediately(STATE(request_complete));
  }
  HASSERT(part_stream_);
  size_t data_len = body_read_size_ - helper_.remaining_;
  // if we received some data pass it on to the handler
  if (data_len)
  {
    bool abort_req = false;
    auto res = part_stream_(&req_, "", body_len_, buf_.data(), data_len
                          , body_offs_, (body_offs_ + data_len) >= body_len_
                          , &abort_req);
    body_offs_ += data_len;
    if (res && !res_)
    {
      res_.reset(res);
    }
    if (abort_req)
    {
      return call_immediately(STATE(send_response_headers));
    }
  }
  if (body_offs_ < body_len_)
  {
    size_t data_req = std::min(body_len_ - body_offs_, body_read_size_);
    return read_repeated_with_timeout(&helper_, timeout_, fd_, buf_.data()
                                    , data_req, STATE(stream_body));
  }
  return yield_and_call(STATE(send_response_headers));
}

StateFlowBase::Action HttpRequestFlow::start_multipart_processing()
{
  // check if the request has the "Expect: 100-continue" header. If it does
  // send the 100/continue line so the client starts streaming data.
  if (!req_.header(HttpHeader::EXPECT).compare("100-continue"))
  {
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Sending:%s", fd_
      , req_.uri().c_str(), multipart_res_.c_str());
    return write_repeated(&helper_, fd_, multipart_res_.c_str()
                        , multipart_res_.length()
                        , STATE(read_multipart_headers));
  }
  return call_immediately(STATE(read_multipart_headers));
}

extern std::map<HttpHeader, string> well_known_http_headers;
StateFlowBase::Action HttpRequestFlow::parse_multipart_headers()
{
  // https://tools.ietf.org/html/rfc7578
  // https://tools.ietf.org/html/rfc2388 (obsoleted by above)
  if (helper_.hasError_)
  {
    req_.error(true);
    return call_immediately(STATE(request_complete));
  }
  else if (helper_.remaining_ == header_read_size_ && buf_.empty())
  {
    return yield_and_call(STATE(read_multipart_headers));
  }

  // parse the boundary marker on our first pass through the headers
  if (part_boundary_.empty())
  {
    string type = req_.header(HttpHeader::CONTENT_TYPE);
    if (type.find('=') == string::npos)
    {
      LOG_ERROR("[Httpd fd:%d] Unable to find multipart/form-data bounary "
                "marker, giving up:\n%s", fd_, req_.to_string().c_str());
      req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      return call_immediately(STATE(abort_request));
    }
    part_boundary_.assign(type.substr(type.find_last_of('=') + 1));
    LOG(VERBOSE, "[Httpd fd:%d] multipart/form-data boundary: %s (%zu)"
      , fd_, part_boundary_.c_str(), part_boundary_.length());
    part_count_ = 0;
  }

  // add any data that has been received to the parse buffer
  size_t bytes_received = header_read_size_ - helper_.remaining_;
  raw_header_.append((char *)buf_.data(), bytes_received);
  buf_.clear();
  
  // if we don't have an EOL string in the data yet, get more data
  if (raw_header_.find(HTML_EOL) == string::npos)
  {
    if (raw_header_.length() < config_httpd_max_header_size())
    {
      LOG(VERBOSE
        , "[Httpd fd:%d] no EOL character yet, reading more data: %zu\n%s"
        , fd_, raw_header_.size(), raw_header_.c_str());
      return yield_and_call(STATE(read_multipart_headers));
    }
    LOG_ERROR("[Httpd fd:%d] Received %zu bytes without being able to parse "
              "headers, aborting.", fd_, raw_header_.length());
    LOG_ERROR("request:%s", req_.to_string().c_str());
    LOG_ERROR(raw_header_.c_str());
    req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
    return call_immediately(STATE(abort_request));
  }

  // parse the data we have into delimited lines of header data, this will
  // leave some data in the raw_header_ which will need to be pushed back
  // into the buf_ after we reach the body segment.
  vector<string> lines;
  size_t parsed = tokenize(raw_header_, lines, HTML_EOL, false);
  // drop whatever has been tokenized so we don't process it again
  LOG(INFO, "[Httpd fd:%d,uri:%s] body: %zu, parsed: %zu, header: %zu"
    , fd_, req_.uri().c_str(), body_len_, parsed, raw_header_.length());
  raw_header_.erase(0, parsed);

  // reduce the body size by the amount of data we have successfully parsed.
  body_len_ -= parsed;

  LOG(INFO, "[Httpd fd:%d,uri:%s] parsed: %zu, body: %zu", fd_
    , req_.uri().c_str(), parsed, body_len_);

