axf33480/ESP32CommandStation/src/Interfaces/http/HttpRequestFlow.cpp
  // process any remaining lines as headers until we reach a blank line
  int processed_lines = 0;
  for (auto &line : lines)
  {
    processed_lines++;
    LOG(INFO, "[Httpd fd:%d,uri:%s] line(%zu/%zu): ||%s||"
      , fd_, req_.uri().c_str(), processed_lines, lines.size(), line.c_str());
    if (line.empty())
    {
      if (found_part_boundary_)
      {
        LOG(INFO
          , "[Httpd fd:%d,uri:%s] found blank line, starting body stream"
          , fd_, req_.uri().c_str());
        process_part_body_ = true;
        // Check if we have processed all parsed lines, if not add them back to
        // the buffer for deferred processing.
        if (processed_lines != lines.size())
        {
          LOG(INFO
            , "[Httpd fd:%d,uri:%s] Processed %zu/%zu lines, adding remaining "
              "lines to body payload"
            , fd_, req_.uri().c_str(), processed_lines, lines.size());
          // add the unprocessed lines back to the 
          raw_header_.assign(string_join(lines.begin() + processed_lines
                                       , lines.end(), HTML_EOL) + raw_header_);
        }
        break;
      }
      else
      {
        LOG_ERROR("[Httpd fd:%d,uri:%s] Missing part boundary marker, aborting "
                  "request", fd_, req_.uri().c_str());
        req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
        return call_immediately(STATE(abort_request));
      }
    }
    else if (line.find(part_boundary_) != string::npos)
    {
      // skip the first two bytes as the line will be: --<boundary>
      if (found_part_boundary_)
      {
        LOG(INFO
          , "[Httpd fd:%d,uri:%s] End of multipart/form-data segment(%d)"
          , fd_, req_.uri().c_str(), part_count_);
        found_part_boundary_ = false;
        if (line.find_last_of("--") == line.length() - 2)
        {
          LOG(INFO, "[Httpd fd:%d,uri:%s] End of last segment reached"
            , fd_, req_.uri().c_str());
          return yield_and_call(STATE(send_response_headers));
        }
      }
      else
      {
        LOG(INFO
          , "[Httpd fd:%d,uri:%s] Start of multipart/form-data segment(%d)"
          , fd_, req_.uri().c_str(), part_count_);
        found_part_boundary_ = true;
        // reset part specific data
        part_len_ = 0;
        part_offs_ = 0;
        part_count_++;
        part_filename_.assign("");
        part_type_.assign("text/plain");
      }
    }
    else if (found_part_boundary_)
    {
      std::pair<string, string> parts = break_string(line, ": ");
      if (!parts.first.compare("form-data"))
      {
        // ignored field
      }
      else if (!parts.first.compare("name"))
      {
        // ignored field (for now)
      }
      else if (!parts.first.compare(
            well_known_http_headers[HttpHeader::CONTENT_TYPE]))
      {
        part_type_.assign(parts.second);
        LOG(INFO
          , "[Httpd fd:%d,uri:%s] multipart/form-data segment(%d) uses %s:%s"
          , fd_, req_.uri().c_str(), part_count_
          , well_known_http_headers[HttpHeader::CONTENT_TYPE].c_str()
          , part_type_.c_str());
      }
      else if (!parts.first.compare(
                  well_known_http_headers[HttpHeader::CONTENT_DISPOSITION]))
      {
        // extract filename if present
        vector<string> disposition;
        tokenize(parts.second, disposition, "; ");
        for (auto &part : disposition)
        {
          if (part.find("filename") != string::npos)
          {
            vector<string> file_parts;
            tokenize(part, file_parts, "\"");
            part_filename_.assign(file_parts[1]);
            LOG(INFO
              , "[Httpd fd:%d,uri:%s] multipart/form-data segment(%d) "
                "filename detected as '%s'"
              , fd_, req_.uri().c_str(), part_count_, part_filename_.c_str());
          }
          else
          {
            LOG_ERROR(
              "[Httpd fd:%d,uri:%s] Unrecognized field in segment(%d): %s"
              , fd_, req_.uri().c_str(), part_count_, part.c_str());
          }
        }
      }
      else
      {
        LOG_ERROR("[Httpd fd:%d,uri:%s] Received unexpected header in segment, "
                  "aborting\n%s", fd_, req_.uri().c_str(), line.c_str());
        req_.set_status(HttpStatusCode::STATUS_BAD_REQUEST);
        return call_immediately(STATE(abort_request));
      }
    }
  }
  if (process_part_body_)
  {
    // if there was some data leftover from the parsing of the headers,
    // transfer it back to the pending buffer and start streaming it.
    if (!raw_header_.empty())
    {
      buf_.assign(raw_header_.begin(), raw_header_.end());
      LOG(INFO, "[Httpd fd:%d,uri:%s] segment(%d) size %zu/%zu"
        , fd_, req_.uri().c_str(), part_count_, buf_.size(), body_len_);
      body_len_ += buf_.size();
      raw_header_.assign("");
    }

    // size is expanded to account for "--" and "\r\n", default to expecting a
    // single part. If there is leftover body_len_ after we process this chunk
    // we will return to this state to get the next part.
    part_len_ = body_len_ - (part_boundary_.size() + 4);
    LOG(INFO, "[Httpd fd:%d,uri:%s] segment(%d) size %zu/%zu"
      , fd_, req_.uri().c_str(), part_count_, part_len_, body_len_);
    size_t data_req = std::min(part_len_, body_read_size_ - buf_.size());
    
    LOG(INFO, "[Httpd fd:%d,uri:%s] Requesting %zu/%zu bytes for segment(%d)"
      , fd_, req_.uri().c_str(), data_req, part_len_, part_count_);
    // read the payload and process it in chunks
    return read_repeated_with_timeout(&helper_, timeout_, fd_
                                    , buf_.data() + buf_.size(), data_req
                                    , STATE(stream_multipart_body));
  }
  return yield_and_call(STATE(read_multipart_headers));
}

StateFlowBase::Action HttpRequestFlow::read_multipart_headers()
{
  // If we have data in the buffer already and it is more than the size of
  // what we are trying to read, call directly into the parser to clear the
  // data.
  if (!buf_.empty() && buf_.size() >= header_read_size_)
  {
    return call_immediately(STATE(parse_multipart_headers));
  }

  // We either have no data or less bytes of data than header_read_size_.
  // Request enough data for at least header_read_size_ number of bytes.
  LOG(VERBOSE
    , "[Httpd fd:%d,uri:%s] requesting %zu bytes for multipart/form-data "
      "processing", fd_, req_.uri().c_str(), header_read_size_ - buf_.size());
  return read_repeated_with_timeout(&helper_, timeout_, fd_
                                  , buf_.data() + buf_.size()
                                  , header_read_size_ - buf_.size()
                                  , STATE(parse_multipart_headers));
}

StateFlowBase::Action HttpRequestFlow::stream_multipart_body()
{
  if (helper_.hasError_)
  {
    req_.error(true);
    return call_immediately(STATE(request_complete));
  }
  HASSERT(part_stream_);
  size_t data_len = body_read_size_ - helper_.remaining_;
  if (data_len)
  {
    if (body_len_ > data_len)
    {
      body_len_ -= data_len;
    }
    else
    {
      body_len_ = 0;
    }
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Received %zu/%zu bytes", fd_
      , req_.uri().c_str(), part_offs_, part_len_);
    bool abort_req = false;
    auto res = part_stream_(&req_, part_filename_, part_len_, buf_.data()
                          , data_len, part_offs_
                          , (part_offs_ + data_len) >= part_len_, &abort_req);
    part_offs_ += data_len;
    if (res && !res_)
    {
      res_.reset(res);
    }
    if (abort_req)
    {
      return yield_and_call(STATE(send_response_headers));
    }
  }
  // if we didn't receive any data or we need to read more data to reach the
  // end of the part, try to retrieve more data.
  if (part_offs_ < part_len_)
  {
    size_t data_req = std::min(part_len_ - part_offs_, body_read_size_);
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Requesting %zu bytes", fd_
      , req_.uri().c_str(), data_req);
    return read_repeated_with_timeout(&helper_, timeout_, fd_, buf_.data()
                                    , data_req, STATE(stream_multipart_body));
  }
  if (body_len_)
  {
    return yield_and_call(STATE(read_multipart_headers));
  }

  return yield_and_call(STATE(send_response_headers));
}

