axf33480/ESP32CommandStation/src/Interfaces/http/HttpRequestFlow.cpp
StateFlowBase::Action HttpRequestFlow::send_response_headers()
{
  // when there is no response object created, default to the status code from
  // the request.
  if (!res_)
  {
    LOG(VERBOSE, "no response body, creating one with %d", req_.status_);
    res_.reset(new AbstractHttpResponse(req_.status_));
  }
  size_t len = 0;
  bool keep_alive = req_.keep_alive() &&
                    req_count_ < config_httpd_max_req_per_connection();
  uint8_t *payload = res_->get_headers(&len, keep_alive);
  LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Sending headers using %zu bytes (%d)."
    , fd_, req_.uri().c_str(), len, res_->code_);
  return write_repeated(&helper_, fd_, payload, len, STATE(send_response_body));
}

StateFlowBase::Action HttpRequestFlow::send_response_body()
{
  if (req_.method() == HttpMethod::HEAD)
  {
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] HEAD request, no body required.", fd_
      , req_.uri().c_str());
  }
  else if (res_->get_body_length())
  {
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Sending body of %d bytes.", fd_
      , req_.uri().c_str(), res_->get_body_length());
    // check if we can send the entire response in one call or not.
    if (res_->get_body_length() > config_httpd_response_chunk_size())
    {
      LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Converting to streamed response.", fd_
        , req_.uri().c_str());
      response_body_offs_ = 0;
      LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Sending [%d-%d/%d]", fd_
        , req_.uri().c_str(), response_body_offs_
        , config_httpd_response_chunk_size(), res_->get_body_length());
      return write_repeated(&helper_, fd_, res_->get_body()
                          , config_httpd_response_chunk_size()
                          , STATE(send_response_body_split));
    }
    return write_repeated(&helper_, fd_, res_->get_body()
                        , res_->get_body_length(), STATE(request_complete));
  }
  return yield_and_call(STATE(request_complete));
}

StateFlowBase::Action HttpRequestFlow::send_response_body_split()
{
  // check if there has been an error and abort if needed
  if (helper_.hasError_)
  {
    LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Error reported during write", fd_
      , req_.uri().c_str());
    req_.error(true);
    return yield_and_call(STATE(request_complete));
  }
  response_body_offs_ += (config_httpd_response_chunk_size() -
                          helper_.remaining_);
  if (response_body_offs_ >= res_->get_body_length())
  {
    // the body has been sent fully
    return yield_and_call(STATE(request_complete));
  }
  size_t remaining = res_->get_body_length() - response_body_offs_;
  if (remaining > config_httpd_response_chunk_size())
  {
    remaining = config_httpd_response_chunk_size();
  }
  LOG(VERBOSE, "[Httpd fd:%d,uri:%s] Sending [%d-%d/%d]", fd_
    , req_.uri().c_str(), response_body_offs_
    , response_body_offs_ + remaining, res_->get_body_length());
  return write_repeated(&helper_, fd_, res_->get_body() + response_body_offs_
                      , remaining, STATE(send_response_body_split));
}

StateFlowBase::Action HttpRequestFlow::request_complete()
{
  uint32_t proc_time = USEC_TO_MSEC(esp_timer_get_time() - start_time_);
  if (!req_.uri().empty())
  {
    LOG(INFO, "[Httpd fd:%d,uri:%s] Processed in %d ms (%d).", fd_
      , req_.uri().c_str(), proc_time, res_->code_);
  }
  req_count_++;
  if (!req_.keep_alive() || req_.error() ||
      req_count_ >= config_httpd_max_req_per_connection() ||
      req_.uri().empty())
  {
    req_.reset();
    return delete_this();
  }

  return call_immediately(STATE(start_request));
}

StateFlowBase::Action HttpRequestFlow::upgrade_to_websocket()
{
  // keep the socket open since we will reuse it as the websocket
  close_ = false;
  new WebSocketFlow(server_, fd_, remote_ip_, req_.header(HttpHeader::WS_KEY)
                  , req_.header(HttpHeader::WS_VERSION)
                  , server_->ws_handler(req_.uri()));
  req_.reset();
  return delete_this();
}

StateFlowBase::Action HttpRequestFlow::abort_request()
{
  req_.error(true);
  return call_immediately(STATE(send_response_headers));
}

} // namespace http
} // namespace esp32cs
